{
  "title": "contact",
  "inputHelpLabel": "help for {{input}} input",
  "form": {
    "help": "The contact form fields marked with an asterisk are mandatory. The required fields are: name, email, subject, message, data processing and reCaptcha.",
    "required": "Required fields",
    "name": {
      "label": "name",
      "placeholder": "name",
      "help": "The name can only contain letters, spaces, dashes and apostrophes. The name must contain at least 5 and a maximum of 60 characters.",
      "errors": {
        "blank": "Enter the name!",
        "toLong": "The name must contain a maximum of 60 characters!",
        "toshort": "The name must include at least 5 characters!",
        "invalid": "The name contains invalid characters, use only letters, spaces, dashes and apostrophes!"
      }
    },
    "email": {
      "label": "e-mail",
      "placeholder": "e-mail",
      "help": "The proper e-mail format examples: name@surname.com or name.surname@company.com.",
      "errors": {
        "blank": "Enter the e-mail address!",
        "invalid": "Enter the proper e-mail address!"
      }
    },
    "subject": {
      "label": "subject",
      "placeholder": "subject",
      "help": "The subject can only contain letters, numbers, spaces, and characters ,.)-:(!?'. The subject must contain at least 5 and a maximum of 500 characters.",
      "errors": {
        "blank": "Enter the subject",
        "toLong": "The subject must contain a maximum of 500 characters",
        "toshort": "The subject must include at least 5 characters",
        "invalid": "The subject contains invalid characters, use only letters, numbers, spaces and characters ,.)-:(!?'!"
      }
    },
    "message": {
      "label": "message",
      "placeholder": "message",
      "help": "The message can only contain letters, numbers, spaces, and characters ,.)-:(!?'. The message must contain at least 5 and a maximum of 2000 characters.",
      "errors": {
        "blank": "Enter the message!",
        "toLong": "The message must contain a maximum of 2000 characters!",
        "toshort": "The message must include at least 5 characters!",
        "invalid": "The message contains invalid characters, use only letters, numbers, spaces and characters ,.)-:(!?'!"
      }
    },
    "captcha": {
      "errors": {
        "blank": "Please check the reCAPTCHA field!",
        "invalid": "Validation against robots was unsuccessful. Please try again."
      }
    },
    "rodo": {
      "label": "I've read the information about data processing",
      "messages": [
        "I agree to the processing of personal data in accordance with the law on the protection of personal data in connection with sending a message via the contact form.",
        "Providing this data is voluntary, but necessary to process the query. The data entered in the contact form won't be save in any database and will be processed only to respond to the message.",
        "The personal data administrator is Aleksander Fret."
      ]
    },
    "emalicopy": "send me a copy of this message",
    "submit": {
      "label": "send",
      "aria": "send the message"
    },
    "success": "Thank you for sending me a message.",
    "failed": "The message couldn't be sent. Please try again."
  },
  "social": {
    "linkedin": {
      "url": "https://www.linkedin.com/in/aleksander-fret/",
      "label": "my LinkedIn profile"
    },
    "github": {
      "url": "my GitHub account",
      "label": "https://github.com/alemikolo"
    },
    "bitbucket": {
      "url": "https://bitbucket.org/alemikolo/",
      "label": "my Bitbucket account"
    },
    "twitter": {
      "url": "https://twitter.com/AleksanderFret",
      "label": "my Twitter account"
    }
  }
}