
{
  "title": "profil zawodowy",
  "professions": [{
      "key": "frontend",
      "imageAlt": "Fragment mojego kodu",
      "name": "Front-end web developer",
      "advantages": [
        "Tworzę aplikacje i witryny internetowe z wykorzystaniem nowoczesnych technologii i narzędzi front-endowych, takich jak ES6, React, Redux, Webpack (<1>poznaj moje umiejętności</1>).",
        "Projekty, które dotąd wykonałem, to strony firmowe, osobiste oraz aplikacje ukierunkowane na szlifowanie warsztatu programistycznego (<1>zobacz moje portfolio</1>).",
        "Mam nieduże doświadczenie z technologiami back-end'owymi - czasem używam PHP i MySQL.",
        "Potrafię projektować interfejsy użytkownika. Pomaga mi w tym bogate doświadczenie w dziedzinie grafiki. Przywiązuję dużą wagę do zagadnień UX.",
        "Cały czas rozwijam swoje umiejętności - ostatnio ukończyłem wszechstronny program stypendialny ufundowany przez Google: Udacity Front-End Web Developer Nanodegree (<1>sprawdź moje wykształcenie</1>)."
      ]
    },
    {
      "key": "graphic",
      "imageAlt": "Jedna z moich ulotek",
      "name": "Grafik",
      "advantages": [
        "Posiadam bogatą praktykę redakcyjną, obejmującą m.in. projektowanie layoutów, skład publikacji, przygotowanie do druku.",
        "Mam szerokie kompetencje w zakresie oprogramowania graficznego. Najlepiej znam CorelDraw, Adobe Photoshop, InDesign, Illustrator.",
        "Moje umiejętności zostały docenione podczas Ogólnopolskiego Przeglądu Książki Krajoznawczo-Turystycznej – przewodnik, który opracowałem, otrzymał III nagrodę: za „[...] nowoczesną formę edytorską, funkcjonalność [...]”."
      ]
    },
    {
      "key": "cartography",
      "imageAlt": "Jedna z moicj map",
      "name": "Kartograf",
      "advantages": [
        "Mam duże doświadczenie w opracowywaniu różnorodnych map: turystycznych, ściennych, szkolnych, planów miast...",
        "Potrafię używać systemów do przetwarzania informacji przestrzennych (znam Global Mapper).",
        "Za „Atlas regionalny województwa łódzkiego” wykonany w ramach pracy magisterskiej, otrzymałem wyróżnienie w konkursie Ministerstwa Transportu i Budownictwa."
      ]
    }
  ]
}